{
    "M. Papa Samba Diop est titulaire d’un Master 1 en ingénierie informatique ainsi que d’un DESS en gestion des microentreprises. Fort de plus de 8 ans d’expérience en tant qu’ingénieur de données senior, il a développé une expertise solide dans la conception et le déploiement de solutions de traitement de données, tant dans des environnements cloud qu’on-premise.": "Mr. Papa Samba Diop holds a Master 1 in Computer Engineering as well as a DESS in Microenterprise Management. With over 8 years of experience as a senior data engineer, he has developed solid expertise in the design and deployment of data processing solutions, in both cloud and on-premise environments.",
    "Certifié dans plus de six domaines clés, dont Apache Spark 3.0 Python, Azure Data Engineer, Azure Power BI, Azure Data Fundamentals et IBM Enterprise Design Thinking, M. Diop maîtrise un large éventail de technologies infonuagiques et analytiques telles qu’Azure Synapse Analytics, Azure Databricks, Azure Data Factory, SQL Server, Oracle, Hive, HDInsight, Hortonworks, Cloudera, PySpark et Power BI. Sa formation sur MS Fabric et Synapse renforce sa capacité à répondre aux besoins complexes des entreprises en matière de transformation digitale.": "Certified in more than six key areas, including Apache Spark 3.0 Python, Azure Data Engineer, Azure Power BI, Azure Data Fundamentals, and IBM Enterprise Design Thinking, Mr. Diop masters a wide range of cloud and analytical technologies such as Azure Synapse Analytics, Azure Databricks, Azure Data Factory, SQL Server, Oracle, Hive, HDInsight, Hortonworks, Cloudera, PySpark, and Power BI. His training in MS Fabric and Synapse strengthens his ability to meet complex business needs for digital transformation.",
    "Reconnu pour sa polyvalence, son autonomie et son sens du service client, M. Diop fait preuve d’une grande capacité d’adaptation et d’un esprit d’équipe remarquable. Il se distingue par sa rigueur, sa rapidité d’apprentissage et son aptitude à résoudre des problèmes complexes, ce qui fait de lui un atout stratégique pour tout projet de gestion et valorisation des données.": "Recognized for his versatility, autonomy, and sense of customer service, Mr. Diop demonstrates a great capacity for adaptation and a remarkable team spirit. He is distinguished by his rigor, quick learning ability, and aptitude for solving complex problems, making him a strategic asset for any data management and valuation project.",
    "Principaux domaines d’intervention": "Primary areas of intervention",
    "Développement et intégration de données": "Data development and integration",
    "Ingénierie de données": "Data engineering",
    "Agriculture et Pêche": "Agriculture and Fishing",
    "Santé": "Health",
    "Formation académique": "Education",
    "Master1 en Génie Informatique": "Master 1 in Computer Engineering",
    "2009": "2009",
    "Université Dakar Bourguiba,": "Dakar Bourguiba University,",
    "Dakar, Sénégal": "Dakar, Senegal",
    "Licence en Génie Informatique": "Bachelor's degree in Computer Engineering",
    "2006": "2006",
    "DESS en Gestion de la Microentreprise": "DESS in Microenterprise Management",
    "2006-2008": "2006-2008",
    "CIESA-Canada,": "CIESA-Canada,",
    "New-Brunswick, Canada": "New Brunswick, Canada",
    "Certifications": "Certifications",
    "Certified Associate Developer for Apache Spark 3.0 Python": "Certified Associate Developer for Apache Spark 3.0 Python",
    "2023": "2023",
    "Databricks": "Databricks",
    "Montréal, Canada": "Montreal, Canada",
    "Azure Enterprise Data Analyst DP-500": "Azure Enterprise Data Analyst DP-500",
    "2022": "2022",
    "Microsoft": "Microsoft",
    "Azure Power BI Data Analyst PL-300": "Azure Power BI Data Analyst PL-300",
    "Azure Data engineer DP-203": "Azure Data Engineer DP-203",
    "Résumé des interventions": "Work Experience Summary",
    "Société Conseil Groupe LGS": "LGS Group Consulting Company",
    "No": "No",
    "Client": "Client",
    "Projet": "Project",
    "Fonction": "Role",
    "Envergure(j-p.)": "Scope (man-days)",
    "Année": "Year",
    "Effort(mois)": "Effort (months)",
    "14": "14",
    "CIUSSS CN": "CIUSSS CN",
    "Centre de Commandement des opérations et de la Fluidité": "Operations and Flow Command Center",
    "Développeur BI": "BI Developer",
    "1400": "1400",
    "12/2024- 09/2025": "12/2024- 09/2025",
    "10": "10",
    "13": "13",
    "LGS RH": "LGS HR",
    "Traitement et automatisation des CV avec Generative AI, Tableau de bord RH": "Resume Processing and Automation with Generative AI, HR Dashboard",
    "Ingénieur de données": "Data Engineer",
    "800": "800",
    "07/2024- 12/2024": "07/2024- 12/2024",
    "4": "4",
    "12": "12",
    "MAPAQ": "MAPAQ",
    "Intégration de données de la géomatique": "Geomatics Data Integration",
    "2 500": "2,500",
    "07/2023- 06/2024": "07/2023- 06/2024",
    "11": "11",
    "Stelpro": "Stelpro",
    "Implémentation Datawarehouse et Power BI": "Data Warehouse and Power BI Implementation",
    "300": "300",
    "04/2023-06/2023": "04/2023-06/2023",
    "3": "3",
    "Maintien et évolution EDM et géomatique": "Maintenance and Evolution of EDM and Geomatics",
    "05/2022-03/2023": "05/2022-03/2023",
    "Baamtu": "Baamtu",
    "09": "09",
    "Orange Sénégal": "Orange Senegal",
    "- Architecture Bigdata/IA,": "- Big Data/AI Architecture,",
    "- Mise en place Datalake, - SAS Offload : Modernisation BI": "- Datalake implementation, - SAS Offload: BI Modernization",
    "Architecte et Lead Ingénieur de données": "Architect and Lead Data Engineer",
    "12 800": "12,800",
    "01/2019-10/2021": "01/2019-10/2021",
    "22": "22",
    "Atos Sénégal": "Atos Senegal",
    "08": "08",
    "- Radar : Gestion de fraude Telco base sur le Bigdata et l’IA": "- Radar: Telco fraud management based on Big Data and AI",
    "- Reporting OM : Tableau de bord Orange Money": "- OM Reporting: Orange Money Dashboard",
    "- Dashboard BM : Reporting KPIs Business": "- BM Dashboard: Business KPIs Reporting",
    "- IT4ITN : Gestion de logs": "- IT4ITN: Log management",
    "Architecte et Ingénieur de données": "Architect and Data Engineer",
    "4 600": "4,600",
    "01/2017-12/2018": "01/2017-12/2018",
    "24": "24",
    "Atos WorldGrid": "Atos WorldGrid",
    "07": "07",
    "Enedis": "Enedis",
    "STM (Système de Traitements des Mesures)": "STM (Measurement Processing System)",
    "Ingénieur d’études et développement": "Software Engineer",
    "3 600": "3,600",
    "06/2016-11/2016": "06/2016-11/2016",
    "6": "6",
    "06": "06",
    "SGA-MSM : système analytique « multi-sided Service Market »": "SGA-MSM: \"Multi-sided Service Market\" analytical system",
    "Ingénieur d’études et développement et": "Software Engineer and",
    "5 600": "5,600",
    "10/2015-05/2016": "10/2015-05/2016",
    "8": "8",
    "Coders4Africa": "Coders4Africa",
    "05": "05",
    "C4A": "C4A",
    "- Elikya : système de tontine": "- Elikya: tontine system",
    "- Kenefa : système de gestion INFRA et RH santé Afrikik": "- Kenefa: infra and health HR management system for Afrikik",
    "Développeur full stack": "Full Stack Developer",
    "1 800": "1,800",
    "11/2012-07/2013": "11/2012-07/2013",
    "9": "9",
    "USAID/ERA": "USAID/ERA",
    "04": "04",
    "Assistance aux usagers;": "User Assistance;",
    "Universités et écoles d’agriculture": "Agriculture Universities and Schools",
    "Spécialiste TI": "IT Specialist",
    "4 000": "4,000",
    "01/2013-08/2015": "01/2013-08/2015",
    "20": "20",
    "Unitech": "Unitech",
    "03": "03",
    "- UBank": "- UBank",
    "- UStock": "- UStock",
    "- UTrans": "- UTrans",
    "Concepteur et développeur": "Designer and Developer",
    "1 500": "1,500",
    "03/2010-12/2012": "03/2010-12/2012",
    "15": "15",
    "MeteoSoft": "MeteoSoft",
    "02": "02",
    "PostFinance": "PostFinance",
    "MeteoPoste : Système de banque postale": "MeteoPoste: Postal Bank System",
    "Développeur": "Developer",
    "2 400": "2,400",
    "12/2007-02/2010": "12/2007-02/2010",
    "UVA (Université Virtuelle Africaine)": "AVU (African Virtual University)",
    "01": "01",
    "UVA": "AVU (African Virtual University)",
    "Assistance aux usagers": "User Assistance",
    "UCAD Wi-Fi Hotspot": "UCAD Wi-Fi Hotspot",
    "Développeur et Soutien technique": "Developer and Technical Support",
    "10/2006-11/2007": "10/2006-11/2007",
    "Société Conseil Groupe LGS, une société IBM": "LGS Group Consulting Company, an IBM company",
    "CIUSSS de la Capitale Nationale": "CIUSSS de la Capitale Nationale",
    "Mandat no:": "Mandate No:",
    "Projet :": "Project:",
    "Centre de Commandement des Operations et de la Fluidité": "Operations and Flow Command Center",
    "Envergure :": "Scope:",
    "1400 jours-personnes": "1400 man-days",
    "Fonction :": "Role:",
    "Conseiller et Développeur BI": "BI Consultant and Developer",
    "Période :": "Period:",
    "Décembre 2024 à septembre 2025": "December 2024 to September 2025",
    "Efforts :": "Efforts:",
    "10 mois": "10 months",
    "Référence :": "Reference:",
    "Felix Dugas (Felix.dugas.ciussscn@ssss.gouv.qc.ca)": "Felix Dugas (Felix.dugas.ciussscn@ssss.gouv.qc.ca)",
    "Dans le cadre du Plan de mise en œuvre des changements nécessaires en santé publié en 2022, ma mission en tant que développeur Power BI visait à améliorer la fluidité du parcours des usagers et à renforcer le soutien des équipes de terrain. Ce mandat a nécessité une expertise approfondie en intégration de données et en développement de rapports Power BI pour offrir une meilleure visibilité et faciliter une prise de décision rapide et éclairée.": "As part of the 2022 Implementation Plan for Necessary Changes in Health, my mission as a Power BI developer aimed to improve the flow of user paths and strengthen support for field teams. This mandate required deep expertise in data integration and Power BI report development to provide better visibility and facilitate rapid, informed decision-making.",
    "M. Diop effectue les tâches suivantes :": "Mr. Diop performs the following tasks:",
    "Analyse": "Analysis",
    "Analyse et profilage des sources de données : Conduite d'une analyse détaillée et du profilage des sources de données pour construire un modèle de données cohérent et robuste.": "Data Source Analysis and Profiling: Conducted a detailed analysis and profiling of data sources to build a coherent and robust data model.",
    "Collaboration avec les parties prenantes : Utilisation de Miro pour collaborer efficacement avec les parties prenantes afin de définir et analyser les besoins spécifiques.": "Stakeholder Collaboration: Used Miro to collaborate effectively with stakeholders to define and analyze specific needs.",
    "Modélisation/Architecture": "Modeling / Architecture",
    "Construction du modèle de données en étoile : Élaboration d'un modèle de données en étoile, optimisé pour les requêtes et les mesures DAX.": "Star Schema Construction: Developed a star schema data model, optimized for DAX queries and measures.",
    "Développement": "Development",
    "Développement de rapports interactifs sur Power BI : Création de rapports interactifs sur Power BI, améliorant significativement la fluidité du parcours des usagers et accélérant la prise de décision.": "Interactive Power BI Report Development: Created interactive Power BI reports, significantly improving user flow and accelerating decision-making.",
    "Accroissement de la visibilité sur les indicateurs clés : Développement de rapports offrant une meilleure visibilité sur les places disponibles, les statuts des usagers, les prévisions, les bloquants et délais etc.": "Increased Visibility into KPIs: Developed reports providing better visibility into available spots, user status, forecasts, blockers, delays, etc.",
    "Formation et accompagnement : Accompagnement et formation des équipes techniques et fonctionnelles pour garantir une compréhension approfondie et une utilisation efficace des outils développés.": "Training and Support: Provided support and training to technical and functional teams to ensure thorough understanding and effective use of the developed tools.",
    "Interfacer avec Power Apps pour le suivi des alertes": "Interface with Power Apps for alert tracking",
    "Appliquer les politiques de sécurité et de protection des données sensibles dans Power BI.": "Apply security policies and protect sensitive data in Power BI.",
    "Développer et paramétrer les tableaux de bord pour le suivi et la bonne prise de décision dans Power BI.": "Develop and configure dashboards for monitoring and informed decision-making in Power BI.",
    "Test/Optimisation": "Testing / Optimization",
    "Tester, optimiser les mesures, les performances, la simplicité des développements.": "Test and optimize measures, performance, and development simplicity.",
    "Documentations/ Transferts de compétences": "Documentation / Knowledge Transfer",
    "Documenter et transférer les développements et compétences.": "Document and transfer developments and skills.",
    "Accompagnement et formation des équipes techniques et fonctionnelles pour garantir une compréhension approfondie et une utilisation efficace des outils développés.": "Support and training of technical and functional teams to ensure thorough understanding and effective use of the developed tools.",
    "Les livrables suivants sont réalisés par M. Diop durant ce mandat :": "The following deliverables were completed by Mr. Diop during this mandate:",
    "Rapport Power BI": "Power BI Report",
    "Code SQL, DAX, M": "SQL, DAX, M code",
    "Modèle dimensionnel": "Dimensional Model",
    "Documentation": "Documentation",
    "Documentation technique et Guide utilisateur": "Technical Documentation and User Guide",
    "Documents d’études et d’analyses": "Study and Analysis Documents",
    "Technologies utilisées dans le cadre du mandat:": "Technologies used in the mandate:",
    "oracle, power bi fabric, sharepoint, power apps, dax, sql,": "Oracle, Power BI Fabric, SharePoint, Power Apps, DAX, SQL,",
    "Environnement technologique complet du mandat :": "Full Technological Environment of the Mandate:",
    "ORACLE, microsoft power bi , office 365": "Oracle, Microsoft Power BI, Office 365",
    "LGS Projets internes": "LGS Internal Projects",
    "800 jours-personnes": "800 man-days",
    "Ingénieur de données et Développeur en Intelligence d’affaires": "Data Engineer and Business Intelligence Developer",
    "Juillet 2024 – octobre 2024": "July 2024 – October 2024",
    "4 mois": "4 months",
    "Bassem Monla (basmonla@ca.ibm.com)": "Bassem Monla (basmonla@ca.ibm.com)",
    "Ce projet consiste à développer des solutions pour supporter des travaux des RH, ainsi travailler sur des opportunités de marché.": "This project involves developing solutions to support HR work and work on market opportunities.",
    "M. Diop a effectué les tâches suivantes :": "Mr. Diop performed the following tasks:",
    "A Effectuer un diagnostic initial pour comprendre les processus sous-jacents et identifier les besoins organisationnels.": "Conducted an initial diagnosis to understand underlying processes and identify organizational needs.",
    "Analyser les processus et les flux de données pour identifier les opportunités d'amélioration.": "Analyzed processes and data flows to identify improvement opportunities.",
    "Analyser et intégrer les sources de données dans Power BI et SQL Server à partir d’un plan établi.": "Analyzed and integrated data sources into Power BI and SQL Server based on an established plan.",
    "Construction du Construire le modèle de données en étoiles dans Power BI (modèle Kimball)": "Constructed the star schema data model in Power BI (Kimball model)",
    "Développement et Automatisation": "Development and Automation",
    "Développer des paquets (packages) SSIS": "Develop SSIS packages",
    "Implémenter les processus dans Airflow (lecture Box, copie CV, soumission avec Assistant AI, sauvegarder le JSON).": "Implemented processes in Airflow (reading Box, copying resumes, submitting with AI Assistant, saving JSON).",
    "Automatiser l’intégration des diverses sources de données.": "Automated the integration of various data sources.",
    "Automatiser l’extraction des CVs avec Power Automate et IBM Consulting Advantage.": "Automated resume extraction with Power Automate and IBM Consulting Advantage.",
    "Effectuer des tests d’évaluation pour l’automatisation avec Selenium.": "Conducted assessment tests for automation with Selenium.",
    "Package SSIS": "SSIS Package",
    "Code SQL, code Python, DAX, M, Visual basic": "SQL, Python, DAX, M, Visual Basic code",
    "Documentation technique": "Technical Documentation",
    "SQL, Python, Selenium, Json": "SQL, Python, Selenium, JSON",
    "SSIS, SQL Server, Power BI, Power Automate, Airflow, IBM Consulting Advantage, Selenium": "SSIS, SQL Server, Power BI, Power Automate, Airflow, IBM Consulting Advantage, Selenium",
    "Ministère de l’Agriculture, des Pêcheries et de l’Alimentation (MAPAQ)": "Ministry of Agriculture, Fisheries and Food (MAPAQ)",
    "Maintien et évolution de l’entrepôt de données et de la couche géomatique": "Maintenance and Evolution of the Data Warehouse and Geomatics Layer",
    "2 500 jours-personnes": "2500 man-days",
    "Ingénieur de données et Conseiller en intelligence d’affaires": "Data Engineer and Business Intelligence Consultant",
    "Juillet 2023 – juin 2024": "July 2023 – June 2024",
    "12 mois": "12 months",
    "Hayette Boumerzoug (hayette.boumerzoug@mapaq.gouv.qc.ca)": "Hayette Boumerzoug (hayette.boumerzoug@mapaq.gouv.qc.ca)",
    "Pour sa transformation numérique, le MAPAQ cherchait une expertise pour la maintenance et l’évolution de son entrepôt de données et un conseil pour la migration vers une plateforme moderne de l’entrepôt et de la couche géospatiale.": "For its digital transformation, MAPAQ sought expertise for the maintenance and evolution of its data warehouse and advice for migrating the warehouse and geospatial layer to a modern platform.",
    "M. Diop a effectué les tâches suivantes:": "Mr. Diop performed the following tasks:",
    "Analyse et collaboration": "Analysis and Collaboration",
    "Analyser et profiler les sources de données afin de construire un modèle de données cohérent": "Analyze and profile data sources to build a consistent data model",
    "Collaborer avec les analystes pour définir les besoins en données.": "Collaborate with analysts to define data needs.",
    "Constater le recensement des outils et proposer des techniques innovantes pour l'ingestion et l'exploitation des données : filtres, tri et drilling (forage)": "Review tool inventory and propose innovative techniques for data ingestion and exploitation: filters, sorting, and drilling",
    "Participer aux rencontres de travail et encourager le respect des normes et méthodologies internes.": "Participate in work meetings and encourage compliance with internal standards and methodologies.",
    "Développer des ETL pour l'intégration des données d'entrepôt et des couches géographiques.": "Develop ETLs for integrating warehouse data and geographical layers.",
    "Migrer et intégrer les données géospatiales vers de nouvelles ETL avec FME, Python et ArcGIS selon la planification.": "Migrate and integrate geospatial data into new ETLs with FME, Python, and ArcGIS according to plan.",
    "Concevoir et implémenter les flux de données, incluant sources, déplacements, traitements, et redirections.": "Design and implement data flows, including sources, movements, processing, and redirections.",
    "Transferts": "Transfers",
    "Moderniser l'infrastructure de gestion des données pour l'automatisation.": "Modernize the data management infrastructure for automation.",
    "Former les ressources internes à la gestion des flux de données.": "Train internal resources in data flow management.",
    "Documenter les d’analyses et de développements ETL": "Document ETL analysis and development",
    "Programmes FME": "FME Programs",
    "Code SQL, code Python": "SQL, Python code",
    "SQL, OWB, Orchestrator, Excel, Power BI, FME Desktop, FME, Python": "SQL, OWB, Orchestrator, Excel, Power BI, FME Desktop, FME, Python",
    "Oracle, OWB, Orchestrator, Excel, Power BI, FME Desktop, FME, ArcGIS, Azure Devops, visual Studio": "Oracle, OWB, Orchestrator, Excel, Power BI, FME Desktop, FME, ArcGIS, Azure DevOps, Visual Studio",
    "STELPRO": "STELPRO",
    "Construction d’un entrepôt de données pour Power BI": "Construction of a Data Warehouse for Power BI",
    "300 jours-personnes": "300 man-days",
    "Ingénieur en Intelligence d’affaires": "Business Intelligence Engineer",
    "Avril 2023 – Juin 2023": "April 2023 – June 2023",
    "3 mois": "3 months",
    "Du Buisson (s.dubuisson@stelpro.com)": "Du Buisson (s.dubuisson@stelpro.com)",
    "Dans le cadre du besoin de centraliser et d'établir une source unique de données pour Power BI.": "As part of the need to centralize and establish a single source of truth for Power BI.",
    "Analyser et profiler les sources de données afin de construire un modèle de données cohérent.": "Analyze and profile data sources to build a coherent data model.",
    "Organiser des sessions de validation des indicateurs clés de performance avec les parties prenantes.": "Organize KPI validation sessions with stakeholders.",
    "Construire un modèle de données structuré pour intégrer les données dans PowerBI.": "Construct a structured data model to integrate data into Power BI.",
    "Valider les indicateurs clés de performance en fonction des besoins du client et des objectifs stratégiques de l'organisation.": "Validate KPIs based on customer needs and organizational strategic objectives.",
    "Veiller à la configuration des tableaux de bord pour une consultation plus efficace des données (filtres).": "Ensure dashboard configuration for more efficient data consultation (filters).",
    "Migrer des rapports Excel existants dans Power BI en utilisant l’approche Kimball": "Migrate existing Excel reports to Power BI using the Kimball approach",
    "Configurer les paramètres de sécurité dans Power BI pour restreindre ou autoriser l'accès aux tableaux de bord, rapports et jeux de données.": "Configure safety settings in Power BI to restrict or authorize access to dashboards, reports, and datasets.",
    "Implémenter les modèles physiques dans SQL server.": "Implement physical models in SQL Server.",
    "Développer et déployer les packages SSIS.": "Develop and deploy SSIS packages.",
    "Assurer l’automatisation des tâches (jobs) dans SQL Server.": "Ensure task automation (jobs) in SQL Server.",
    "Surveiller le bon déroulement du RUN et assurer la création de rapports.": "Monitor the RUN process and ensure report creation.",
    "Transferts et Documentation": "Transfers and Documentation",
    "Assurer l'appropriation complète et autonome des tableaux de bord par l'équipe interne en réalisant un transfert de connaissances.": "Ensure full and autonomous ownership of the dashboards by the internal team through knowledge transfer.",
    "Produire le guide d’utilisateur et la documentation des processus d’intégration et du modèle de données.": "Produce the user guide and documentation for integration processes and the data model.",
    "Veiller au transfert de connaissance aux différentes équipes.": "Ensure knowledge transfer to different teams.",
    "Code SQL, DAX, M,": "SQL, DAX, M code,",
    "SQL, Power bi, SSIS, SAP, Excel, DAx": "SQL, Power BI, SSIS, SAP, Excel, DAX",
    "SQL Server, azure sql db, Power bi, SSIS, Visual studio, SSMS, SAP, Azure Devops, teams": "SQL Server, Azure SQL DB, Power BI, SSIS, Visual Studio, SSMS, SAP, Azure DevOps, Teams",
    "Mai 2022 – mars 2023": "May 2022 – March 2023",
    "11 mois": "11 months",
    "Veiller au respect des normes ministérielles et de la méthodologie en place.": "Ensure compliance with ministerial standards and existing methodology.",
    "Analyser et apporter des corrections aux besoins et bogues de l’entrepôt de données": "Analyze and make corrections to data warehouse needs and bugs",
    "Architecture et modernisation plateforme Bigdata/IA, Mise en place Datalake, - SAS Offload : Modernisation BI": "Big Data / AI Platform Architecture and Modernization, Datalake Setup, - SAS Offload: BI Modernization",
    "12 800 jours-personnes": "12,800 man-days",
    "Architecte et lead ingénieur de données": "Architect and Lead Data Engineer",
    "Janvier 2019 – octobre 2021": "January 2019 – October 2021",
    "22 mois": "22 months",
    "Mouhamadou Lamine Camara (+221776376273)": "Mouhamadou Lamine Camara (+221776376273)",
    "Ce projet consiste à la mise en place d’un lac de données (Data Lake) pour centraliser et valoriser les données de l’organisation. Ce projet comprenait également la modernisation de l’entrepôt de données existant, afin d’en améliorer la performance, la flexibilité et l’accessibilité. La migration de données vers des environnements Big Data, ainsi que le développement d’applications adaptées, permettant une exploitation optimale des volumes croissants d’information.": "This project involves setting up a Data Lake to centralize and value organizational data. The project also included modernizing the existing data warehouse to improve performance, flexibility, and accessibility. Data migration to Big Data environments and development of adapted applications allowed for optimal processing of increasing information volumes.",
    "Analyse, Conception et Architecture": "Analysis, Design, and Architecture",
    "Analyser et documenter les sources de données et le datawarehouse afin d’assurer une migration cohérente vers le Big data.": "Analyze and document data sources and the data warehouse to ensure consistent migration to Big Data.",
    "Mener des ateliers pour recueillir, affiner et définir les besoins, prérequis et exigences": "Conduct workshops to gather, refine, and define needs, prerequisites, and requirements",
    "Élaborer et présenter les architectures de conception détaillée (logicielle et données).": "Develop and present detailed design architectures (software and data).",
    "Partager les bonnes pratiques de création de modèles et de rapports et visualisations en mode libre-service.": "Share best practices for creating models, reports, and self-service visualizations.",
    "Spécifier et recommander les technologies pour bien gérer les données structurées et non structurées.": "Specify and recommend technologies for effectively managing structured and unstructured data.",
    "Modéliser les formats et zones de stockage appropriés et efficients.": "Model appropriate and efficient storage formats and zones.",
    "Spécifier et supporter la mise en place d’évaluation du risque (scoring) d’attribution de crédit des clients d’Orange Mobile-Money.": "Specify and support the implementation of risk assessment (scoring) for credit attribution to Orange Mobile-Money customers.",
    "Effectuer les revues de code et assurer le respect des normes et des bonnes pratiques.": "Conduct code reviews and ensure compliance with standards and best practices.",
    "Faire des recommandations d’optimisation de stockage et de traitements des données de la plateforme Big data.": "Make recommendations for optimizing data storage and processing on the Big Data platform.",
    "Supporter les développeurs aux analyses des bogues et les accompagner sur les prises en charge des solutions.": "Support developers in bug analysis and guide them on handling solutions.",
    "Effectuer l’audit de la plateforme Big data et partager des recommandations sur l’état de l’art et les bonnes pratiques.": "Perform Big Data platform audit and share state-of-the-art recommendations and best practices.",
    "Effectuer des preuves de concept et prototypes sur de nouvelles solutions et proposer un plan de migration et d'implémentation.": "Perform proofs of concept and prototypes on new solutions and propose a migration and implementation plan.",
    "Livrer les études d’opportunités de développement et de déploiement de modèles de Machine Learning, du Cloud hybride, Databricks, de la 5G, Blockchain, etc.": "Deliver opportunity studies for the development and deployment of Machine Learning models, hybrid Cloud, Databricks, 5G, Blockchain, etc.",
    "Développer des PoCs, des cas d’usage, des ETLs et intégrations de données": "Develop PoCs, use cases, ETLs, and data integrations",
    "Tester les programmes d’intégration et d’ingestion de données": "Test data integration and ingestion programs",
    "Rédiger les documents/réponses d'études de faisabilité qui comportent différents diagrammes de conception, les impacts, planification, etc.": "Draft feasibility study documents/responses including various design diagrams, impacts, planning, etc.",
    "Rédiger le dossier d’architecture en collaboration avec les architectes infra et réseaux, de bases données et systèmes.": "Draft the architecture dossier in collaboration with infrastructure, network, database, and systems architects.",
    "Code Spark, Code SQL, code Python": "Spark code, SQL code, Python code",
    "Dossier d’architecture": "Architecture Dossier",
    "Azure Storage, Data factory, Azure Synapse, Hadoop, azure logicapps, Apache spark, Hive, Kafka, SQL, NO SQL, NiFi, AWS S3, Power BI, ELK, Kibana, SCALA, JAVA, BASH": "Azure Storage, Data Factory, Azure Synapse, Hadoop, Azure Logic Apps, Apache Spark, Hive, Kafka, SQL, NO SQL, NiFi, AWS S3, Power BI, ELK, Kibana, SCALA, JAVA, BASH",
    "LINUX, Azure, draw.io, Excalidraw, Confluence, Jira, bitbucket, Jenkins, sonar, Hadoop, Cloudera, SQL server, Oracle, Mysql, HBase, NiFi, AWS S3, Tableau, Power BI, ELK, Azure HD Insight, Databricks": "LINUX, Azure, Draw.io, Excalidraw, Confluence, Jira, Bitbucket, Jenkins, Sonar, Hadoop, Cloudera, SQL Server, Oracle, MySQL, HBase, NiFi, AWS S3, Tableau, Power BI, ELK, Azure HD Insight, Databricks",
    "Radar : Gestion de fraude Telco basée sur le Bigdata et l’IA, Reporting OM : Tableau de bord Orange Money, Dashboard BM : Reporting KPIs Business, IT4ITN : Gestion de logs": "Radar: Telco fraud management based on Big Data and AI, OM Reporting: Orange Money Dashboard, BM Dashboard: Business KPIs Reporting, IT4ITN: Log Management",
    "4 600 jours-personnes": "4600 man-days",
    "Architecte et Ingénieur de données et en Intelligence d’Affaires": "Data and Business Intelligence Architect and Engineer",
    "Janvier 2017 – décembre 2018": "January 2017 – December 2018",
    "24 mois": "24 months",
    "Sandene Ndao (+221 773336700)": "Sandene Ndao (+221 773336700)",
    "Ce projet consiste à la mise en place d’un lac de données (Data Lake) pour centraliser et valoriser les données de l’organisation. Ce projet comprenait la modernisation de l’entrepôt de données existant, afin d’en améliorer la performance, la flexibilité et l’accessibilité. La migration de données vers des environnements Big Data, ainsi que l’implémentation des nouveaux cas d’usage (KPIs, fraude, Recommandations, etc.).": "This project consists of implementing a Data Lake to centralize and value organization data. The project included modernizing the existing data warehouse to improve performance, flexibility, and accessibility. Data migration to Big Data environments and implementing new use cases (KPIs, fraud, recommendations, etc.).",
    "Collaborer avec les principaux acteurs de l'entreprise, experts d’affaires, architectes et experts IT scientistes et analystes de données.": "Collaborate with key enterprise actors, business experts, architects, and IT data scientists and analysts.",
    "Formuler et appliquer les recommandations sur les bonnes pratiques de gestion du Data Lake, et du développement du code, de sécurité et de gouvernance de données.": "Formulate and apply recommendations on Data Lake management best practices, code development, security, and data governance.",
    "Faire des recommandations sur les formats et les zones de stockage des données.": "Make recommendations on data storage formats and zones.",
    "Collecter, centraliser et optimiser les flux de données dans le Data Lake.": "Collect, centralize, and optimize data flows in the Data Lake.",
    "Définir et appliquer les règles de politique de sécurité et de gouvernance de données.": "Define and apply security policy and data governance rules.",
    "Développer les KPIs pour aide à la décision.": "Develop KPIs for decision support.",
    "Développer des applications distribuées Big data.": "Develop distributed Big Data applications.",
    "Implémenter les tests unitaires et d’intégration et des mécanismes de surveillance.": "Implement unit and integration tests and monitoring mechanisms.",
    "Diriger les développements des applications Big data.": "Lead Big Data application developments.",
    "Encadrer et accompagner les développeurs et ingénieurs de données.": "Mentor and support data developers and engineers.",
    "Documenter le code et les flux d’ingestion": "Document code and ingestion flows",
    "ETL, Code Spark, Code SQL": "ETL, Spark code, SQL code",
    "Modèle de données": "Data Model",
    "LINUX, Azure, draw.io, Excalidraw, Confluence, Jira, bitbucket, Jenkins, sonar, Hadoop, Cloudera, SQL server, Oracle, Mysql, HBase, NiFi, AWS S3, Tableau, Power BI, ELK, Azure HD Insight": "LINUX, Azure, Draw.io, Excalidraw, Confluence, Jira, Bitbucket, Jenkins, Sonar, Hadoop, Cloudera, SQL Server, Oracle, MySQL, HBase, NiFi, AWS S3, Tableau, Power BI, ELK, Azure HD Insight",
    "Enedis France": "Enedis France",
    "Système de traitement des mesures (STM)": "Measurement Processing System (STM)",
    "3 600 jours-personnes": "3600 man-days",
    "Juin 2016 – novembre 2016": "June 2016 – November 2016",
    "6 mois": "6 months",
    "Momadou Ndoye (+221 786380724)": "Momadou Ndoye (+221 786380724)",
    "Ce projet consiste au traitement de la donnée de mesure et numérique et au stockage de données collectées et stockées dans la base STM (Système de traitement des mesures). Il s’agit d’un projet de TMA (Tierce Maintenance Applicative). Il s’agissait de corriger les bogues et développer de nouvelles évolutions de l’application entreprise et des scripts Teradata.": "This project involves processing measurement and digital data and storing data in the STM base (Measurement Processing System). It is an AMS (Application Maintenance Services) project. It involved fixing bugs and developing new evolutions for the corporate application and Teradata scripts.",
    "Corriger les anomalies/bogues détectés dans l’application du Système de Traitement des Mesures (STM).": "Fix anomalies/bugs detected in the Measurement Processing System (STM) application.",
    "Développer les nouvelles demandes d'évolution de l’application.": "Develop new requests for development of the application.",
    "Être disposé à répondre aux besoins et urgences de la clientèle.": "Readily respond to customer needs and emergencies.",
    "Code SQL, code Java": "SQL code, Java code",
    "Java, GWT, TERADATA, HPALM. Bitbucket, maven": "Java, GWT, Teradata, HPALM, Bitbucket, Maven",
    "SGA-MSM : système analytique « Multi-sided Service Market »": "SGA-MSM: \"Multi-sided Service Market\" analytical system",
    "5 600 jours-personnes": "5600 man-days",
    "Ingénieur d’études et développement, Ingénieur de données": "Software Engineer, Data Engineer",
    "Octobre 2015 – mai 2016": "October 2015 – May 2016",
    "8 mois": "8 months",
    "Ce projet consiste au stockage et traitement des données des compteurs électriques afin d’offrir de meilleures expériences aux usagers. SGA-MSM est un projet R&amp;D utilisant les technologies du Big data pour améliorer l’expérience client sur la consommation d’énergie et faire des recommandations en utilisant le Machine Learning, des moteurs de prédictions sur le fonctionnement des matériels domestiques et des compteurs intelligents.": "This project involves the storage and processing of electricity meter data in order to offer better experiences to users. SGA-MSM is an R&amp;D project using Big Data technologies to improve the customer experience on energy consumption and make recommendations using Machine Learning, prediction engines on the operation of domestic equipment and smart meters.",
    "Supporter l'architecte principal sur la définition de l’architecture microservice.": "Support the main architect on the definition of the microservice architecture.",
    "Allouer des recommandations aux développements des applications microservices.": "Provide recommendations for microservice application developments.",
    "Implémenter l’architecture et développement de briques microservices.": "Implement microservice architecture and core building blocks.",
    "Travailler avec les parties prenantes, les experts en Intelligence d’affaires, experts technologiques et architectes de solutions.": "Work with stakeholders, BI experts, tech experts, and solution architects.",
    "Développer des jobs et KPIs pour la valorisation des données de l’énergie.": "Develop jobs and KPIs for energy data valuation.",
    "Documentation et transferts": "Documentation and Transfers",
    "Éditer les documentations techniques des différentes solutions applicatives.": "Edit technical documentation for various application solutions.",
    "Accompagner les alternants stagiaires dans la montée en compétence et la rédaction de leur mémoire.": "Mentor interns in skill acquisition and thesis writing.",
    "ETL, Code Spark, code SQL, code Java": "ETL, Spark code, SQL code, Java code",
    "Programmes nodejs": "Node.js Programs",
    "Document d’architecture": "Architecture Document",
    "Spring3, javaEE, Javascript/NodeJS, MeanJS, AngularJS, Ionic framework, DBeaver, Postgres, Cassandra, HDP, Apache spark, Hadoop, Hive, JazzRTC, MySQL": "Spring3, JavaEE, Javascript/NodeJS, MeanJS, AngularJS, Ionic framework, DBeaver, Postgres, Cassandra, HDP, Apache Spark, Hadoop, Hive, JazzRTC, MySQL",
    "Pour les mandats 1 à 5, vous trouverez un résumé dans le tableau « résumé des réalisations » du présent document.": "For mandates 1 to 5, you will find a summary in the \"summary of achievements\" table in this document.",
    "Résumé des technologies": "Technologies Summary",
    "Technologies": "Technologies",
    "Mois": "Months",
    "Langages de programmation et progiciels": "Programming Languages and Software Packages",
    "Environnements et infrastructures": "Environments and Infrastructures",
    "SQL-TSQL": "SQL-TSQL",
    "60": "60",
    "WINDOWS": "Windows",
    "240": "240",
    "Python": "Python",
    "AZURE DEVOPS": "AZURE DEVOPS",
    "Java": "Java",
    "48": "48",
    "LINUX": "LINUX",
    "scala": "Scala",
    "MICROSOFT AZURE CLOUD": "Microsoft Azure Cloud",
    "dax, M Power query": "DAX, M Power Query",
    "16": "16",
    "aws": "AWS",
    "Bases de données": "Databases",
    "OUTILS, LOGICIELS ET MATÉRIELS": "Tools, Software and Hardware",
    "ORACLE": "ORACLE",
    "cloudera, hortonworks": "Cloudera, Hortonworks",
    "SQL SERVER": "SQL SERVER",
    "OWB": "OWB",
    "cassandra": "Cassandra",
    "AZURE SQL DB": "AZURE SQL DB",
    "Elastic search": "Elasticsearch",
    "36": "36",
    "AZURE SYNAPSE ANALYTICS": "AZURE SYNAPSE ANALYTICS",
    "MYSQL": "MYSQL",
    "Microsoft BI (SSMS, SSAS, SSIS, SSRS)": "Microsoft BI (SSMS, SSAS, SSIS, SSRS)",
    "HADOOP": "HADOOP",
    "AZURE DATA FACTORY": "AZURE DATA FACTORY",
    "DATABRICKS": "DATABRICKS",
    "Méthodologies": "Methodologies",
    "AZURE DATA LAKE": "AZURE DATA LAKE",
    "KANBAN": "KANBAN",
    "GITHUB": "GITHUB",
    "AGILE": "AGILE",
    "96": "96",
    "SCRUM": "SCRUM",
    "VISUAL STUDIO": "VISUAL STUDIO",
    "Microsoft TFS": "Microsoft TFS",
    "Architectures": "Architectures",
    "power bi fabric": "Power BI Fabric",
    "KIMBALL": "KIMBALL",
    "power automate": "Power Automate",
    "DATAVAULT": "DATAVAULT",
    "2": "2",
    "visual code": "Visual Code",
    "MEDAILLON": "MEDALLION",
    "excalidraw": "Excalidraw",
    "Microservices": "Microservices",
    "miro": "Miro",
    "Formations et perfectionnements": "Training and Professional Development",
    "Microsoft Fabric": "Microsoft Fabric",
    "2025": "2025",
    "Montréal": "Montreal",
    "Langues parlées, écrites": "Spoken and Written Languages",
    "Langue": "Language",
    "Niveau de maîtrise": "Proficiency Level",
    "Langue maternelle": "Native Language",
    "Français": "French",
    "Avancé": "Advanced",
    "Oui": "Yes",
    "Anglais": "English",
    "Professionnel": "Professional",
    "Non": "No",
    "Wolof": "Wolof",
    "Prénom Nom": "First Name Last Name",
    "Curriculum vitae2 février 20221|9": "Curriculum Vitae February 2, 2022 1|9",
    "Curriculum vitae6 January 20264|9": "Curriculum Vitae January 6, 2026 4|9",
    "Papa Samba DIOP": "Papa Samba DIOP",
    "Curriculum vitae6 January 20261|2": "Curriculum Vitae January 6, 2026 1|2",
    "Papa Samba Diop": "Papa Samba Diop"
}